Revit 2024 API
CircuitNamingScheme.GetCombinedParameters Method
 Gets the combined parameters.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public IList<TableCellCombinedParameterData> GetCombinedParameters()
Visual Basic
Public Function GetCombinedParameters As IList(Of TableCellCombinedParameterData)
Visual C++
public:
IList<TableCellCombinedParameterData^>^ GetCombinedParameters()
Return Value
 Gets array of TableCellCombinedParameterData with the combined parameters data.
See Also
CircuitNamingScheme Class
Autodesk.Revit.DB.Electrical Namespace